{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65536"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Cast", "op": "Cast", "input": ["input_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/FFT3D", "op": "FFT3D", "input": ["StatefulPartitionedCall/functional_1/ftl/Cast"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/ftl/Shape", "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack", "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/ftl/strided_slice", "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack", "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/ftl/strided_slice", "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack", "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/ftl/strided_slice_1", "StatefulPartitionedCall/functional_1/ftl/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/ftl/mul"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/functional_1/ftl/FFT3D", "StatefulPartitionedCall/functional_1/ftl/Cast_1"], "attr": {"T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Real", "op": "Real", "input": ["StatefulPartitionedCall/functional_1/ftl/truediv"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Imag", "op": "Imag", "input": ["StatefulPartitionedCall/functional_1/ftl/truediv"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/ftl/Real", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/ftl/Imag", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Complex", "op": "Complex", "input": ["StatefulPartitionedCall/functional_1/ftl/mul_1", "StatefulPartitionedCall/functional_1/ftl/mul_2"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/functional_1/ftl/Complex"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/functional_1/ftl/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/ftl/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/ftl/Relu", "StatefulPartitionedCall/functional_1/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/flatten/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [256, 256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/ftl/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "unknown_0", "shape": [256, 256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [65536, 2], "dtype": "float32"}, {"name": "unknown_2", "shape": [2], "dtype": "float32"}]}]}