{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16257024"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/conv2d/Relu", "StatefulPartitionedCall/functional_1/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/flatten/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of32.bin", "group1-shard2of32.bin", "group1-shard3of32.bin", "group1-shard4of32.bin", "group1-shard5of32.bin", "group1-shard6of32.bin", "group1-shard7of32.bin", "group1-shard8of32.bin", "group1-shard9of32.bin", "group1-shard10of32.bin", "group1-shard11of32.bin", "group1-shard12of32.bin", "group1-shard13of32.bin", "group1-shard14of32.bin", "group1-shard15of32.bin", "group1-shard16of32.bin", "group1-shard17of32.bin", "group1-shard18of32.bin", "group1-shard19of32.bin", "group1-shard20of32.bin", "group1-shard21of32.bin", "group1-shard22of32.bin", "group1-shard23of32.bin", "group1-shard24of32.bin", "group1-shard25of32.bin", "group1-shard26of32.bin", "group1-shard27of32.bin", "group1-shard28of32.bin", "group1-shard29of32.bin", "group1-shard30of32.bin", "group1-shard31of32.bin", "group1-shard32of32.bin"], "weights": [{"name": "unknown", "shape": [5, 5, 1, 256], "dtype": "float32"}, {"name": "unknown_0", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [16257024, 2], "dtype": "float32"}, {"name": "unknown_2", "shape": [2], "dtype": "float32"}]}]}